<a href="https://colab.research.google.com/github/rselent/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/module3-join-and-reshape-data/1_3_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-10-30 19:03:29--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.25.61
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.25.61|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  55.8MB/s    in 3.6s

2019-10-30 19:03:33 (55.2 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
##### YOUR CODE HERE #####

import pandas as pd
import numpy as np
import seaborn as sns

In [7]:
## First, we need to inspect each CSV, to determine which CSVs and which columns
## would give us the data we want. (The above line was also exactly 80 chars)
## This is tedious af, but... c'est la vie.

# Assign each CSV a var, and get some prelim data, so we can find what we want:

aisles = pd.read_csv( 'aisles.csv')
print( aisles.shape)
aisles.head()

(134, 2)

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [0]:
# Irrelevant data; scrubbing

In [8]:
depts = pd.read_csv( 'departments.csv')
print( depts.shape)
depts.head()

(21, 2)

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [0]:
# Irrelevant data; scrubbing

In [9]:
priorOrder = pd.read_csv( 'order_products__prior.csv')
print( priorOrder.shape)
priorOrder.head()

(32434489, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [0]:
# Need product_id, add_to_cart_order

In [15]:
trainOrder = pd.read_csv( 'order_products__train.csv')
print( trainOrder.shape)
trainOrder.head()

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [0]:
# Need product_id, add_to_cart_order

In [11]:
orders = pd.read_csv( 'orders.csv')
print( orders.shape)
orders.head()

(3421083, 7)

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [0]:
# Irrelevant data for task (how many times each product was ordered); scrubbing

In [12]:
products = pd.read_csv( 'products.csv')
print( products.shape)
products.head()

(49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [0]:
# Need product_id, product_name

In [17]:
### Deviation from Lecture work acknowledged

## We still need to combine the product orders CSVs, though
productOrders = pd.concat([ priorOrder, trainOrder])

print( productOrders.shape)
productOrders.head()

(33819106, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [29]:
## Then, merge productOrders with products, to line up product names with orders

# Tried using the _subset method demonstrated in the Lecture, and cannot for the
# life of me get it to work... it's a good thing Python is so intuitive (mostly)

merged = pd.merge( productOrders[[ 'order_id', 'product_id']], 
                  products[[ 'product_id', 'product_name']],
                  how = 'inner',
                  on = 'product_id')
merged.tail(10)

          order_id  ...                                       product_name
33819096   3400803  ...                        Flatbread Pizza All Natural
33819097    774603  ...                                 Chocolate Go Bites
33819098   1351798  ...                            Pure Squeezed  Lemonade
33819099   1832341  ...                         12 Inch Taper Candle White
33819100   2169250  ...                   Wasabi Cheddar Spreadable Cheese
33819101   2269288  ...                  Non-Dairy Coconut Seven Layer Bar
33819102   2507248  ...                  Non-Dairy Coconut Seven Layer Bar
33819103   2271346  ...  Ultra Sun Blossom Liquid 90 loads Fabric Enhan...
33819104   3004244  ...                               Sweetart Jelly Beans
33819105   3376312  ...                            Water With Electrolytes

[10 rows x 3 columns]

In [44]:
## And lastly, use a .value_counts() function (from 1-2 Assignment) to find the
## top 10 selling items and sales totals requested. Order should match this:
# Banana
# Bag of Organic Bananas
# Organic Strawberries
# Organic Baby Spinach
# Organic Hass Avocado
# Organic Avocado
# Large Lemon
# Strawberries
# Limes
# Organic Whole Milk

print( merged[ 'product_name'].value_counts()[:10] )


### Is it possible to format the .value_counts() output?
### Add like, a "{:,}".format to it somehow?

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

In [0]:
## IT MATCHES
## 
## WE DONE BOYS, PACK IT UP, LET'S GO FIND A JOB, WE CAN DO ANYTHING NOW

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [36]:
### After 4-5+ hours of trying to process and unpack all of what was thrown at
### us today _and_ do the Assignment, I'm kind of in a "just get it done" mindset.
### Therefore, because the first 2 points here are pretty ambiguous, I'll be
### moving directly on to the third, Table 2 --> Tidy. Good? Good.

%matplotlib inline        
### ^What's the significance of this again?


# Build table
table1 = pd.DataFrame( 
    [[ np.NaN, 2],
     [ 16,    11],
     [ 3,      1]],
     index = [ 'John Smith', 'Jane Doe', 'Duke Nukem'],
     columns = [ 'treatmentA', 'treatmentB'] )

table2 = table1.T

table2

            John Smith  Jane Doe  Duke Nukem
treatmentA         NaN      16.0         3.0
treatmentB         2.0      11.0         1.0

In [37]:
table2 = table2.reset_index()
table2

        index  John Smith  Jane Doe  Duke Nukem
0  treatmentA         NaN      16.0         3.0
1  treatmentB         2.0      11.0         1.0

In [50]:
## Melt into a "tidy" table (que?)

tidy2 = table2.melt( id_vars= 'index', 
#                   value_vars=[ 'treatmentA', 'treatmentB'],
                    value_vars=[ 'John Smith', 'Jane Doe', 'Duke Nukem'] )
### Why do the names as value_vars work, but treatments don't??

tidy2

        index    variable  value
0  treatmentA  John Smith    NaN
1  treatmentB  John Smith    2.0
2  treatmentA    Jane Doe   16.0
3  treatmentB    Jane Doe   11.0
4  treatmentA  Duke Nukem    3.0
5  treatmentB  Duke Nukem    1.0

In [51]:
### But if it's going to be like that, we might as well make it look good:

# reorder columns, so the sorting/"real index" column is on the left
tidy2 = tidy2[[ 'variable', 'index', 'value']]

tidy2 = tidy2.rename( columns ={
                        'variable': 'name',
                        'index': 'trt',
                        'value': 'result'
                    })
# shorten "treatmentA/B" values by replacing strings
tidy2.trt = tidy2.trt.str.replace( 'treatment', '')

tidy2

         name trt  result
0  John Smith   A     NaN
1  John Smith   B     2.0
2    Jane Doe   A    16.0
3    Jane Doe   B    11.0
4  Duke Nukem   A     3.0
5  Duke Nukem   B     1.0

In [54]:
### Now, instead of the overall comparison between treatments A and B being what
### "jumps out" at us (as it does in the Lecture's tidy1 example), the focus is 
### a bit finer, showing how each treatment affects each patient differently. 
### The data is still the same, but the order changes the immediate perception.

### Just like what Table 1 communicated before we did all of this...?
table2.head()

        index  John Smith  Jane Doe  Duke Nukem
0  treatmentA         NaN      16.0         3.0
1  treatmentB         2.0      11.0         1.0

In [60]:
## Pivoting the table, unmelting it, and showing options in how it's displayed

tidy2Wide = tidy2.pivot_table( index = 'trt', columns = 'name', values = 'result')
print( tidy2Wide, "\n\n ---------- \n")

tidy2Wide = tidy2.pivot_table( index = 'name', columns = 'trt', values = 'result')
print( tidy2Wide)

name  Duke Nukem  Jane Doe  John Smith
trt
A            3.0      16.0         NaN
B            1.0      11.0         2.0

 ----------

trt            A     B
name
Duke Nukem   3.0   1.0
Jane Doe    16.0  11.0
John Smith   NaN   2.0

In [44]:
flights = sns.load_dataset('flights')

# Load seaborn's flights dataset by running the cell below. 
# Then create a pivot table showing the number of passengers by month and year. 
# Use year for the index and month for the columns. You've done it right if you 
# get 112 passengers for January 1949 and 432 passengers for December 1960.

flights

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [63]:
### "You've done it right if..." WE ALREADY GET THAT THOUGH??
### entry 000 = "1949 January  112"
### entry 143 = "1960 December 432"
### it's indexed by year, then by mo--- OHHHHHH

widePeepoFlights = flights.pivot_table( index = 'year', 
                                       columns = 'month', 
                                       values = 'passengers')

# Make it look good by removing the jumbled mess of words in the top corner
# As I'm sure it's relatively easy to infer what's going on here...
widePeepoFlights.columns.name = None
widePeepoFlights.index.name = None

widePeepoFlights

      January  February  March  April  ...  September  October  November  December
1949      112       118    132    129  ...        136      119       104       118
1950      115       126    141    135  ...        158      133       114       140
1951      145       150    178    163  ...        184      162       146       166
1952      171       180    193    181  ...        209      191       172       194
1953      196       196    236    235  ...        237      211       180       201
1954      204       188    235    227  ...        259      229       203       229
1955      242       233    267    269  ...        312      274       237       278
1956      284       277    317    313  ...        355      306       271       306
1957      315       301    356    348  ...        404      347       305       336
1958      340       318    362    348  ...        404      359       310       337
1959      360       342    406    396  ...        463      407       362       405
1960      417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####